## Project 2 Group 5 ETL

##### Members:
- Rebecca Kwon
- Daniel Garza
- Mary Olaitan
- Neil Tipton
- Kristen Wilder

#### Load Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine

#### Load Individual Transformed CSVs to DataFrames

In [8]:
happiness_file = "resources/World_Happiness2018_clean.csv"
happiness_df = pd.read_csv(happiness_file)

In [9]:
happiness_df.head()

   Rank   Country_ID  Happiness Score  GDP per capita  Healthy life expectancy
0     1      Finland            7.632           1.305                    0.874
1     2       Norway            7.594           1.456                    0.861
2     3      Denmark            7.555           1.351                    0.868
3     4      Iceland            7.495           1.343                    0.914
4     5  Switzerland            7.487           1.420                    0.927

In [3]:
tobacco_file = "resources/tobaccoAge15_clean.csv"
tobacco_df = pd.read_csv(tobacco_file)

In [4]:
alcohol_file = "resources/alcoholSubstanceAbuse_clean.csv"
alcohol_df = pd.read_csv(alcohol_file)

#### Connect to Local Database

In [21]:
rds_connection_string = "postgres:postgres@localhost:5432/Happiness_HealthStats"
engine = create_engine(f'postgresql://{rds_connection_string}')

#### Check for Table Names

In [11]:
# Confirm tables
engine.table_names()

['alcohol_2018', 'tobacco_2018', 'happiness_2018']

#### Use pandas to load csv converted DataFrame into database

In [27]:
happiness_df.to_sql(name='happiness_2018', con=engine, if_exists='append', index=False)

In [22]:
tobacco_df.to_sql(name='tobacco_2018', con=engine, if_exists='append', index=False)

In [23]:
alcohol_df.to_sql(name='alcohol_2018', con=engine, if_exists='append', index=False)

#### Confirm data has been added to database by querying

In [28]:
pd.read_sql_query('select * from happiness_2018', con=engine).head()

   Rank   Country_ID  Happiness Score  GDP per capita  Healthy life expectancy
0     1      Finland            7.632           1.305                    0.874
1     2       Norway            7.594           1.456                    0.861
2     3      Denmark            7.555           1.351                    0.868
3     4      Iceland            7.495           1.343                    0.914
4     5  Switzerland            7.487           1.420                    0.927

In [25]:
pd.read_sql_query('select * from tobacco_2018', con=engine).head()

,id,Country_Id,Year,Indicator,Sex,First Tooltip
0,1,Albania,2018,Age-standardized prevalence of current tobacco...,Both sexes,29.2
1,2,Albania,2018,Age-standardized prevalence of current tobacco...,Male,50.5
2,3,Albania,2018,Age-standardized prevalence of current tobacco...,Female,7.9
3,4,Algeria,2018,Age-standardized prevalence of current tobacco...,Both sexes,18.8
4,5,Algeria,2018,Age-standardized prevalence of current tobacco...,Male,36.3

In [26]:
pd.read_sql_query('select * from alcohol_2018', con=engine).head()

,id,Country_ID,Year,Indicator,Sex,First Tooltip
0,1,Afghanistan,2018,Total (recorded+unrecorded) alcohol per capita...,Both sexes,0.210
1,2,Afghanistan,2018,Total (recorded+unrecorded) alcohol per capita...,Male,0.360
2,3,Afghanistan,2018,Total (recorded+unrecorded) alcohol per capita...,Female,0.055
3,4,Albania,2018,Total (recorded+unrecorded) alcohol per capita...,Both sexes,7.170
4,5,Albania,2018,Total (recorded+unrecorded) alcohol per capita...,Male,11.630